---
title: "Add a New Column"
author: "Rj"
date: 2019-04-20
description: "List Test"
type: technical_note
draft: false
---

In [5]:
import pandas as pd

In [6]:
data = {
    'city' : ['Toronto', 'Montreal', 'Waterloo'],
    'points' : [80, 70, 90]
}

In [7]:
data

{'city': ['Toronto', 'Montreal', 'Waterloo'], 'points': [80, 70, 90]}

In [8]:
type(data)

dict

In [9]:
df = pd.DataFrame(data)

In [10]:
df

       city  points
0   Toronto      80
1  Montreal      70
2  Waterloo      90

In [19]:
df = df.assign(code = [1, 2, 3])

In [18]:
df

       city  points  code
0   Toronto      80     1
1  Montreal      70     2
2  Waterloo      90     3